static/Provision.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:ctypes="http://schemas.ogf.org/nsi/2013/12/connection/types" xmlns:header="http://schemas.ogf.org/nsi/2013/12/framework/headers" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <header:nsiHeader>
      <protocolVersion>application/vnd.ogf.nsi.cs.v2.provider+soap</protocolVersion>
      <correlationId>#CORRELATION-ID#</correlationId>
      <requesterNSA>urn:ogf:network:anaeng.global:2024:nsa:nsi-aura</requesterNSA>
      <providerNSA>#PROVIDER-NSA-ID#</providerNSA>
      <replyTo>#REPLY-TO-URL#</replyTo>
    </header:nsiHeader>
  </soap:Header>
  <soap:Body>
    <ctypes:provision>
      <connectionId>#CONNECTION-ID#</connectionId>
    </ctypes:provision>
  </soap:Body>
</soap:Envelope>
